<template>
    
    <div class="container">
        <div class="description block">
            <h3>Описание</h3>
            <div class="texts">
                <p v-for="text in texts">{{text}}</p>
            </div>
            <ul>
                <li v-for="item in list">{{item}}</li>
            </ul>
            <div class="bottom-text">
                <p v-for="text in bottomText">{{text}}</p>
            </div>
        </div>
    </div>
    
</template>

<script>

export default{
    data(){
        return {
            texts : [
                '24.09.2021 Вышла новая редакция части по библиотеке React!',
                'Этот курс направлен на подробное изучение JavaScript без воды, но главное - немедленное применение его на практике.',
                'Это значит, что вы получите материал для работы и мы вместе будем создавать реальные проекты шаг за шагом.',
                'Вторая часть курса - это изучение самой популярной библиотеки на основе JavaScript - React.js со всеми необходимыми технологиями (в том числе и Redux)',
                'Для кого подойдет этот курс?',
            ],
            list: [
                'Если вы ничего не знаете про программирование, но хотите начать',
                'Если вы новичок в JavaScript и хотите быстро его освоить и начать уже применять в работе',
                'Если вы начали своё обучение с JQuery или другого инструмента, но вам не хватает знаний основ',
                'Если вы хотите научить создавать web-приложения',
                'Если вы хотите освоить библиотеку React на реальных проектах'
            ],
            bottomText: [
                'Что внутри курса?',
                'Теория - это хорошо, но без практики результата не будет. Поэтому каждый теоретический блок заканчивается практикой, где вы будете писать приложение, интерактивные элементы на сайте и тд. Все материалы для работы будут предоставлены.'
            ]
        }
    }
}

</script>

<style lang="scss">
    @import '../scss/components/description.scss';
</style>